app/controllers/products_controller.rb

  def create
    @product = Product.new(product_params)

    if @product.save
---
INSERT INTO "products" ("created_at", "name", "price", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Thu, 02 Oct 2014 17:40:13 UTC +00:00], ["name", "Acai"], ["price", "12"], ["updated_at", Thu, 02 Oct 2014 17:40:13 UTC +00:00]]